#include <iostream>

using namespace std;

void bubbleSort(int Array[], int a){ // Хүснэгт дэх элементүүдийг эрэмблэхийн тулд Bubble Sort гэх хэрэглэгчийн функцийг тодорхойлно.
    for(int i=0;i<a-1;i++){ // 0 - ээс хүснэгтийн эцсийн элемент хүртэл 1 - ээр нэмэгдүүлэн давтана.
        for(int j=0;j<a-i-1;j++){ // Дээрх давталт дотор 0 - ээс эцсийн элементээс i - ийн утгыг хассан хүртэл 1 - ээр нэмэгдүүлэн давтана.
            if(Array[j] > Array[j+1]){ // Давталтын явцад дараалалсан элементүүдийн өмнөх нь их утгатай байх эсэхийг шалгана.
                swap(Array[j], Array[j+1]); // Хэрэв үнэн байвал уг дараалалсан элементүүдийн утгыг хооронд нь сольно.
            }
        }

    }
}

void printArray(int Array[], int a){ // Хүснэгт дэх элементүүдийг хэвлэх Хүснэгт хэвлэх гэх хэрэглэгчийн функцийг тодорхойлно.
    for(int i=0;i<a;++i){ // 0 - ээс хүснэгтийн эцсийн элемеинт хүртэл 1 - ээр нэмэгдүүлэн давтана.
        cout << Array[i] <<endl; // Хүснэгтийн элементийн утгыг хэвлэнэ.
    }
}

int main(){
    int a; // Хүснэгтийн хэмжээг авахын тулд а хувьсагчийг int төрлөөр зарлана.
    
    cout << "niit heden too bhin be nza: ";
    cin >> a; // Гараас а хувьсагчид утгыг авч онооно.
    int Array[a]; // Гараас хүснэгтийн хэмжээг авсаны дараа хүснэгтийг int төрлөөр зарлана.
    
    for(int i=0;i<a;i++){ // 0 - ээс а хувьсагчийн утга хүртэл 1 - ээр нэмэгдүүлэх давталт үүсгэнэ.
        cout << "utga oruul: ";
        cin >> Array[i]; // Хүснэгтийн нүд бүхэнд элемент буюу утгыг гараас оруулж өгнө.
    }

    a = sizeof(Array)/sizeof(Array[0]); // Хувьсагч а - д Array - ийн уртыг оруулан хадгална.

    bubbleSort(Array,a); // Bubble Sort функцийг дуудан ажиллуулна, ямар нэгэн байдлаар утга буцаахгүй функц.
    printArray(Array,a); // Хүснэгт хэвлэх функцийг дуудан ажиллуулна, ямар нэгэн байдлаар утга буцаахгүй функц.
}