#include <iostream>

using namespace std;

int main(){
    int a; // Хүснэгтийн хэмжээг авахын тулд а хувьсагчийг int төрлөөр зарлана.
    
    cout << "niit heden too bhin be nza: ";
    cin >> a; // Гараас а хувьсагчид утгыг авч онооно.

    int Array[a-1]; // Гараас хүснэгтийн хэмжээг авсаны дараа хүснэгтийг int төрлөөр зарлана.
    
    for(int i=0;i<a;i++){ // 0 - ээс а хувьсагчийн утга хүртэл 1 - ээр нэмэгдүүлэх давталт үүсгэнэ.
        cout << "utga oruul: ";
        cin >> Array[i]; // Хүснэгтийн нүд бүхэнд элемент буюу утгыг гараас оруулж өгнө.
    }
    for(int i=0;i<a;i++){ // 0 - ээс а хувьсагчийн утга хүртэл 1 - ээр нэмэгдүүлэх давталт үүсгэнэ.
        if(Array[i]%2==0){ // Давталтын явцад хүснэгтийн элемент буюу утгыг 2 - т хуваахад 0 үлдэгдэлтэй эсэхийг шалагана.
            cout << Array[i] << endl; // Хэрэв 2 - т хуваахад 0 үлдэгдэлтэй бол тэгш элемент хэмээн хэвлэж харуулна.
        }
    }
}