#include <iostream>

using namespace std;

double Average(int a){ // Дундажийг олох функцийг 1 аргумент дамжуулан double төрлийн буцаахаар тодорхойлно.
    int sum = 0; // Нийлбэрээ хадгалах int төрлийн утга хадгалах хувьсагчийг анхны 0 утгатай зарлаж өгнө.
    for(int i=1;i<=a;i++){ // 0 - ээс гараас оруулсан тоо хүртэл 1 - ээр нэмэгдүүлэх давталт ашиглана.
        sum+=i; // Давталтын явцад нийлбэр хадгалах хувьсагчид нэмэгдэх тоог(i) нэмэгдүүлнэ.
    }
    return (double) sum/a; // Давталт бүрэн явагдсаны дараах нийлбэрийг нийт нэмэгдэхүүний тоонд хуваан буцаана.
    // Хуваах явцад бутархай тоо гарах боломжтой тул double төрлийн утга буцаахаар тодорхойлсон.
}

int Sum(int a){ // Нийлбэр хэрэглэгчийн функцийг 1 аргумент дамжуулан int төрлийн утга буцаахаар тодорхойлно.
    int sum = 0; // Нийлбэрээ хадгалах int төрлийн утга хадгалах хувьсагчийг анхны 0 утгатай зарлаж өгнө.
    for(int i=0;i<a;i++){ // 0 - ээс гараас оруулсан тоо хүртэл 1 - ээр нэмэгдүүлэх давталт ашиглана.
        sum+=i; // Давталтын явцад нийлбэр хадгалах хувьсагчид нэмэгдэх тоог(i) нэмэгдүүлнэ.
    }
    return sum; // Давталт бүрэн явагдсаны дараах нийлбэр тоог буцаана.
}

int main(){
    int a; // Гараас N тоог авахын тулд бүхэл тоон утга хадгалах хувьсагч зарлана.
    cout << "1 ees N too hurtelh toonii arithmetic average" << endl;
    cout << "N toog oruulna uu: ";
    cin >> a; // Гараас N тоог аван а буюу хувьсагчид авч хадгална.
    cout << "Sum: " << Sum(a) << endl; // Нийлбэр функц руу 1 аргументтайгаар дуудан буцаасан утгыг хэвлэнэ.
    cout << "Dundaj: " << Average(a) << endl; // Дундаж функц руу 1 аргументтайгаар дуудан буцаасан утгыг хэвлэнэ.
}