#include <iostream>

using namespace std;

int main(){
    int a,sum=0; // Хүснэгтийн хэмжээг авахын тулд а хувьсагчийг int төрлөөр зарлана.
    // sum хувьсагчид нийлбэр хадгалах тул анхны утга нь 0 байх нь тохиромжтой.
    cout << "niit heden too bhin be nza: ";
    cin >> a; // Гараас хүснэгтийг уртыг авч а хувьсагчид хадгална.

    int Array[a-1]; // Гараас хүснэгтийн хэмжээг авсаны дараа хүснэгтийг int төрлөөр зарлана.
    
    for(int i=0;i<a;i++){ // 0 - ээс а хувьсагчийн утга хүртэл 1 - ээр нэмэгдүүлэх давталт үүсгэнэ.
        cout << "utga oruul: ";
        cin >> Array[i]; // Хүснэгтийн нүд бүхэнд элемент буюу утгыг гараас оруулж өгнө.
        sum+=Array[i]; // Гараас орж ирсэн утгуудыг sum хувьсагчид нэмнэ.
    }
    cout << "Dundaj: " << (double) sum/a << endl; // Нийлбэрийг олсоны дараа нийт элементийн тоонд хуваан хэвлэнэ.
    // Хуваах явцад бутархай тоо гарах боломжтой бул double төрлөөр утга бүцаах боломжтой болгоно.
}