#include <iostream>

using namespace std;

int main(){
    int a,min,max; // Гараас утга авахад болон их, бага утгуудыг хадгалах int төрлийн хувьсагчийг зарлана.
    
    cout << "niit heden too bhin be nza: ";
    cin >> a; // N тооны утгыг гараас авч а хувьсагчид онооно.

    int Array[a-1]; // N тоо тодорхой болсон тул нийт N урттай хүснэгтийг үүсгэж өгнө.
    
    for(int i=0;i<a;i++){ // 0 - ээс N тоо хүртэл 1 - ээр нэмэгдүүлэх давталт үүсгэнэ.
        cout << "utga oruul: "; 
        cin >> Array[i]; // Давталтын явцад N хэмжээст хүснэгтэд 0 - ээс N хүртэл нүдэнд тус бүрийн утгыг авч оруулна.
    }

    max=Array[0]; // Хүснэгтийн хамгийн эхний элементийг хамгийн их утга гэж үзэн max - д утгыг онооно.
    min=Array[0]; // Хүснэгтийн хамгийн эхний элементийг хамгийн бага утга гэж үзэн min - д утгыг онооно.

    for(int i=0;i<a;i++){ // 0 - ээс N тоо хүртэл 1 - ээр нэмэгдүүлэх давталт үүсгэнэ.
        if(Array[i]>max){ // Давталтын явцад хэрэв max дахь утгаас их утга хүснэгтэд байх эсэхийг нөхцөл тавин шалгана.
            max=Array[i]; // Хэрэв хүснэгтийн элемент бүрээр гүйх явцад max - аас их утга байвал утгыг max - д онооно.
        }
        if(Array[i]<min){ // Давталтын явцад хэрэв min дахь утгаас бага утга хүснэгтэд байх эсэхийг нөхцөл тавин шалгана.
            min=Array[i]; // Хэрэв хүснэгтийн элемент бүрээр гүйх явцад min - аас бага утга байвал утгыг min - д онооно.
        }
    }
    cout << "Hamgiin baga ni: " << min <<endl; // Хүснэгтийн элемент бүрээр гүйсний дараах min - д хадгалагдсан утгыг хэвлэнэ.
    cout << "Hamgiin ih ni: " << max; // Хүснэгтийн элемент бүрээр гүйсний дараах max - д хадгалагдсан утгыг хэвлэнэ.
}